package com.xd.evaluation.utils;

import java.util.Random;

/**
 * 生成唯一数字串
 * Created By Cx On 2018/10/18 17:48
 */
public class UniqueKeyUtil {
    /**
     * 在一毫秒内产生冲突的可能性是 1/10000
     * 如果需要降低冲突可能性，将生成随机数的范围变大更改即可
     * synchronized关键字，防止多线程冲突
     */
    public static synchronized String getUniqueKey() {
        Random random = new Random();
        //生成一个四位的随机数
        String number = String.valueOf(random.nextInt(9000) + 1000);
        return System.currentTimeMillis() + number;
    }

    /**
     * 生成一个三位的姓名
     */
    public static String getNickName(){
        final String[] first = {"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","钟","徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应","宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","於","惠","甄","麴","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓","牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景","詹","束","龙","叶","幸","司","韶","郜","黎","蓟","薄","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","郁","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","舄","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农","温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","宦","艾","鱼","容","向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄","阙","东","殴","殳","沃","利","蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空","曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","後","荆","红","游","竺","权","逯","盖","益","桓","公","万","俟","司","马","上","官","欧","阳","夏","侯","诸","葛","闻","人","东","方","赫","连","皇","甫","尉","迟","公","羊","澹","台","公","冶","宗","政","濮","阳","淳","于","单","于","太","叔","申","屠","公","孙","仲","孙","轩","辕","令","狐","钟","离","宇","文","长","孙","慕","容","鲜","于","闾","丘","司","徒","司","空","亓","官","司","寇","仉","督","子","车","颛","孙","端","木","巫","马","公","西","漆","雕","乐","正","壤","驷","公","良","拓","跋","夹","谷","宰","父","谷","梁","晋","楚","闫","法","汝","鄢","涂","钦","段","干","百","里","东","郭","南","门","呼","延","归","海","羊","舌","微","生","岳","帅","缑","亢","况","后","有","琴","梁","丘","左","丘","东","门","西","门","商","牟","佘","佴","伯","赏","南","宫","墨","哈","谯","笪","年","爱","阳","佟","言","福"};
        final String[] last = {"的","一","了","是","我","不","在","人","们","有","来","他","这","上","着","个","地","到","大","里","说","去","子","得","也","和","那","要","下","看","天","时","过","出","小","么","起","你","都","把","好","还","多","没","为","又","可","家","学","只","以","主","会","样","年","想","能","生","同","老","中","从","自","面","前","头","到","它","后","然","走","很","像","见","两","用","她","国","动","进","成","回","什","边","作","对","开","而","已","些","现","山","民","候","经","发","工","向","事","命","给","长","水","几","义","三","声","于","高","正","妈","手","知","理","眼","志","点","心","战","二","问","但","身","方","实","吃","做","叫","当","住","听","革","打","呢","真","党","全","才","四","已","所","敌","之","最","光","产","情","路","分","总","条","白","话","东","席","次","亲","如","被","花","口","放","儿","常","西","气","五","第","使","写","军","吧","文","运","在","果","怎","定","许","快","明","行","因","别","飞","外","树","物","活","部","门","无","往","船","望","新","带","队","先","力","完","间","却","站","代","员","机","更","九","您","每","风","级","跟","笑","啊","孩","万","少","直","意","夜","比","阶","连","车","重","便","斗","马","哪","化","太","指","变","社","似","士","者","干","石","满","决","百","原","拿","群","究","各","六","本","思","解","立","河","爸","村","八","难","早","论","吗","根","共","让","相","研","今","其","书","坐","接","应","关","信","觉","死","步","反","处","记","将","千","找","争","领","或","师","结","块","跑","谁","草","越","字","加","脚","紧","爱","等","习","阵","怕","月","青","半","火","法","题","建","赶","位","唱","海","七","女","任","件","感","准","张","团","屋","爷","离","色","脸","片","科","倒","睛","利","世","病","刚","且","由","送","切","星","晚","表","够","整","认","响","雪","流","未","场","该","并","底","深","刻","平","伟","忙","提","确","近","亮","轻","讲","农","古","黑","告","界","拉","名","呀","土","清","阳","照","办","史","改","历","转","画","造","嘴","此","治","北","必","服","雨","穿","父","内","识","验","传","业","菜","爬","睡","兴"};
        Random random = new Random();
        int one = random.nextInt(first.length), two = random.nextInt(last.length), three = random.nextInt(last.length);
        return first[one]+last[two]+last[three];
    }

    public static void main(String[] args) {
        System.out.println(getNickName());
        System.out.println(getNickName());
        System.out.println(getNickName());
    }


}
